; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=40, out_folder=htg/blocksworld/training, instance_id=20, seed=2044, goal_proportion=0.1

(define (problem blocksworld-20)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 - object)
 (:init 
    (arm-empty)
    (clear b29)
    (on b29 b2)
    (on b2 b12)
    (on b12 b26)
    (on-table b26)
    (clear b35)
    (on b35 b9)
    (on b9 b11)
    (on-table b11)
    (clear b6)
    (on-table b6)
    (clear b14)
    (on b14 b1)
    (on-table b1)
    (clear b23)
    (on-table b23)
    (clear b20)
    (on-table b20)
    (clear b33)
    (on b33 b5)
    (on b5 b31)
    (on b31 b39)
    (on b39 b16)
    (on b16 b10)
    (on b10 b27)
    (on b27 b24)
    (on b24 b19)
    (on-table b19)
    (clear b25)
    (on-table b25)
    (clear b18)
    (on-table b18)
    (clear b38)
    (on b38 b22)
    (on b22 b30)
    (on-table b30)
    (clear b15)
    (on b15 b36)
    (on b36 b3)
    (on b3 b13)
    (on b13 b28)
    (on b28 b40)
    (on-table b40)
    (clear b4)
    (on-table b4)
    (clear b37)
    (on b37 b32)
    (on b32 b17)
    (on-table b17)
    (clear b34)
    (on-table b34)
    (clear b7)
    (on b7 b21)
    (on b21 b8)
    (on-table b8))
 (:goal  (and 
    (clear b4)
    (on b4 b2)
    (on b2 b1)
    (on b1 b3)
    (on-table b3))))

; plan
1. (unstack b29 b2)
   deleted: (on b29 b2) (clear b29) (arm-empty)
   added: (holding b29) (clear b2)
   goals met: 1 of 5
2. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 5
3. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 0 of 5
4. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 2 of 5
5. (unstack b15 b36)
   deleted: (on b15 b36) (clear b15) (arm-empty)
   added: (holding b15) (clear b36)
   goals met: 2 of 5
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 5
7. (unstack b36 b3)
   deleted: (on b36 b3) (clear b36) (arm-empty)
   added: (holding b36) (clear b3)
   goals met: 2 of 5
8. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 2 of 5
9. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 2 of 5
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 5
11. (unstack b14 b1)
   deleted: (on b14 b1) (clear b14) (arm-empty)
   added: (holding b14) (clear b1)
   goals met: 3 of 5
12. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 3 of 5
13. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 5
14. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 4 of 5
15. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 2 of 5
16. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 5
17. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 3 of 5
18. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 4 of 5
19. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 5
20. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 5 of 5
